# Antidote - plugins list
# Format: username/repo path:path/to/plugin

# Oh-My-Zsh libraries and plugins
ohmyzsh/ohmyzsh path:lib/completion.zsh
ohmyzsh/ohmyzsh path:lib/history.zsh
ohmyzsh/ohmyzsh path:lib/key-bindings.zsh
ohmyzsh/ohmyzsh path:lib/theme-and-appearance.zsh

# History enhancements
ohmyzsh/ohmyzsh path:plugins/history
ohmyzsh/ohmyzsh path:plugins/history-substring-search

# Note: Using zoxide for smart directory navigation instead of z plugins

# FZF integration (provides completion and key bindings)
junegunn/fzf path:shell

# Git integration
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/gitfast
ohmyzsh/ohmyzsh path:plugins/git-extras

# Development tools
ohmyzsh/ohmyzsh path:plugins/node
ohmyzsh/ohmyzsh path:plugins/npm
ohmyzsh/ohmyzsh path:plugins/python
ohmyzsh/ohmyzsh path:plugins/pip
# Note: Using custom rustup completions from ~/.zfunc instead of Oh-My-Zsh plugin
# ohmyzsh/ohmyzsh path:plugins/rust
ohmyzsh/ohmyzsh path:plugins/vscode
ohmyzsh/ohmyzsh path:plugins/github

# Command completion helpers
ohmyzsh/ohmyzsh path:plugins/command-not-found
ohmyzsh/ohmyzsh path:plugins/sudo

# Useful utilities
ohmyzsh/ohmyzsh path:plugins/extract
ohmyzsh/ohmyzsh path:plugins/colored-man-pages

# Fast syntax highlighting
zdharma-continuum/fast-syntax-highlighting kind:defer
zdharma-continuum/fast-syntax-highlighting kind:clone

# Fast auto-suggestions
zsh-users/zsh-autosuggestions kind:defer
zsh-users/zsh-autosuggestions kind:clone

# Command history auto-completion
zsh-users/zsh-history-substring-search

# Better tab completion
zsh-users/zsh-completions

# Additional utilities
MichaelAquilina/zsh-you-should-use
zsh-users/zsh-syntax-highlighting

# Powerlevel10k is loaded conditionally in .zshrc if starship is not available